tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ASRC.h
#define ASRC_ASRCFG_NDPRB_MASK                   (0x80000U)
#define ASRC_ASRCFG_NDPRB_SHIFT                  (19U)
/*! NDPRB - Not Use Default Parameters for RAM-Stored Parameters For Conversion Pair B
 *  0b0..Use default parameters for RAM-stored parameters. Override any parameters already in RAM.
 *  0b1..Don't use default parameters for RAM-stored parameter. Use the parameters already stored in RAM.
 */
#define ASRC_ASRCFG_NDPRB(x)                     (((uint32_t)(((uint32_t)(x)) << ASRC_ASRCFG_NDPRB_SHIFT)) & ASRC_ASRCFG_NDPRB_MASK)

#define ASRC_ASRCFG_NDPRC_MASK                   (0x100000U)
#define ASRC_ASRCFG_NDPRC_SHIFT                  (20U)
/*! NDPRC - Not Use Default Parameters for RAM-Stored Parameters For Conversion Pair C
 *  0b0..Use default parameters for RAM-stored parameters. Override any parameters already in RAM.
 *  0b1..Don't use default parameters for RAM-stored parameters. Use the parameters already stored in RAM.
 */
#define ASRC_ASRCFG_NDPRC(x)                     (((uint32_t)(((uint32_t)(x)) << ASRC_ASRCFG_NDPRC_SHIFT)) & ASRC_ASRCFG_NDPRC_MASK)

#define ASRC_ASRCFG_INIRQA_MASK                  (0x200000U)
#define ASRC_ASRCFG_INIRQA_SHIFT                 (21U)
/*! INIRQA - Initialization for Conversion Pair A is served
 *  0b0..Initialization for Conversion Pair A not served
 *  0b1..Initialization for Conversion Pair A served
 */
#define ASRC_ASRCFG_INIRQA(x)                    (((uint32_t)(((uint32_t)(x)) << ASRC_ASRCFG_INIRQA_SHIFT)) & ASRC_ASRCFG_INIRQA_MASK)

#define ASRC_ASRCFG_INIRQB_MASK                  (0x400000U)
#define ASRC_ASRCFG_INIRQB_SHIFT                 (22U)
/*! INIRQB - Initialization for Conversion Pair B is Served
 *  0b0..Initialization for Conversion Pair B not served
 *  0b1..Initialization for Conversion Pair B served
 */
#define ASRC_ASRCFG_INIRQB(x)                    (((uint32_t)(((uint32_t)(x)) << ASRC_ASRCFG_INIRQB_SHIFT)) & ASRC_ASRCFG_INIRQB_MASK)

#define ASRC_ASRCFG_INIRQC_MASK                  (0x800000U)
#define ASRC_ASRCFG_INIRQC_SHIFT                 (23U)
/*! INIRQC - Initialization for Conversion Pair C is Served
 *  0b0..Initialization for Conversion Pair C not served
 *  0b1..Initialization for Conversion Pair C served
 */
#define ASRC_ASRCFG_INIRQC(x)                    (((uint32_t)(((uint32_t)(x)) << ASRC_ASRCFG_INIRQC_SHIFT)) & ASRC_ASRCFG_INIRQC_MASK)
/*! @} */

/*! @name ASRCSR - ASRC Clock Source */
/*! @{ */

#define ASRC_ASRCSR_AICSA_MASK                   (0xFU)
#define ASRC_ASRCSR_AICSA_SHIFT                  (0U)
/*! AICSA - Input Clock Source A
 *  0b0000..Bit clock 0
 *  0b0001..Bit clock 1
 *  0b0010..Bit clock 2
 *  0b0011..Bit clock 3
 *  0b0100..Bit clock 4
 *  0b0101..Bit clock 5
 *  0b0110..Bit clock 6
 *  0b0111..Bit clock 7
 *  0b1000..Bit clock 8
 *  0b1001..Bit clock 9
 *  0b1010..Bit clock A
 *  0b1011..Bit clock B
 *  0b1100..Bit clock C
 *  0b1101..Bit clock D
 *  0b1110..Bit clock E
 *  0b1111..Clock disabled, connected to zero
 */
#define ASRC_ASRCSR_AICSA(x)                     (((uint32_t)(((uint32_t)(x)) << ASRC_ASRCSR_AICSA_SHIFT)) & ASRC_ASRCSR_AICSA_MASK)

#define ASRC_ASRCSR_AICSB_MASK                   (0xF0U)
#define ASRC_ASRCSR_AICSB_SHIFT                  (4U)
/*! AICSB - Input Clock Source B
 *  0b0000..Bit clock 0
 *  0b0001..Bit clock 1
 *  0b0010..Bit clock 2
 *  0b0011..Bit clock 3
 *  0b0100..Bit clock 4
 *  0b0101..Bit clock 5
 *  0b0110..Bit clock 6
 *  0b0111..Bit clock 7
 *  0b1000..Bit clock 8
 *  0b1001..Bit clock 9
 *  0b1010..Bit clock A
 *  0b1011..Bit clock B
 *  0b1100..Bit clock C
 *  0b1101..Bit clock D
 *  0b1110..Bit clock E
 *  0b1111..Clock disabled, connected to zero
 */
#define ASRC_ASRCSR_AICSB(x)                     (((uint32_t)(((uint32_t)(x)) << ASRC_ASRCSR_AICSB_SHIFT)) & ASRC_ASRCSR_AICSB_MASK)

#define ASRC_ASRCSR_AICSC_MASK                   (0xF00U)
#define ASRC_ASRCSR_AICSC_SHIFT                  (8U)
/*! AICSC - Input Clock Source C
 *  0b0000..Bit clock 0
 *  0b0001..Bit clock 1
 *  0b0010..Bit clock 2
 *  0b0011..Bit clock 3
 *  0b0100..Bit clock 4
 *  0b0101..Bit clock 5
 *  0b0110..Bit clock 6
 *  0b0111..Bit clock 7
 *  0b1000..Bit clock 8
 *  0b1001..Bit clock 9
 *  0b1010..Bit clock A
 *  0b1011..Bit clock B
 *  0b1100..Bit clock C
 *  0b1101..Bit clock D
 *  0b1110..Bit clock E
 *  0b1111..Clock disabled, connected to zero
 */
#define ASRC_ASRCSR_AICSC(x)                     (((uint32_t)(((uint32_t)(x)) << ASRC_ASRCSR_AICSC_SHIFT)) & ASRC_ASRCSR_AICSC_MASK)

#define ASRC_ASRCSR_AOCSA_MASK                   (0xF000U)
#define ASRC_ASRCSR_AOCSA_SHIFT                  (12U)
/*! AOCSA - Output Clock Source A
 *  0b0000..Bit clock 0
 *  0b0001..Bit clock 1
 *  0b0010..Bit clock 2
 *  0b0011..Bit clock 3
 *  0b0100..Bit clock 4
 *  0b0101..Bit clock 5
 *  0b0110..Bit clock 6
 *  0b0111..Bit clock 7
 *  0b1000..Bit clock 8
 *  0b1001..Bit clock 9
 *  0b1010..Bit clock A
 *  0b1011..Bit clock B
 *  0b1100..Bit clock C
 *  0b1101..Bit clock D
 *  0b1110..Bit clock E
 *  0b1111..Clock disabled, connected to zero
 */
#define ASRC_ASRCSR_AOCSA(x)                     (((uint32_t)(((uint32_t)(x)) << ASRC_ASRCSR_AOCSA_SHIFT)) & ASRC_ASRCSR_AOCSA_MASK)

#define ASRC_ASRCSR_AOCSB_MASK                   (0xF0000U)
#define ASRC_ASRCSR_AOCSB_SHIFT                  (16U)
/*! AOCSB - Output Clock Source B
 *  0b0000..Bit clock 0
 *  0b0001..Bit clock 1
 *  0b0010..Bit clock 2
 *  0b0011..Bit clock 3
 *  0b0100..Bit clock 4
 *  0b0101..Bit clock 5
 *  0b0110..Bit clock 6
 *  0b0111..Bit clock 7
 *  0b1000..Bit clock 8
 *  0b1001..Bit clock 9
 *  0b1010..Bit clock A
 *  0b1011..Bit clock B
 *  0b1100..Bit clock C
 *  0b1101..Bit clock D
 *  0b1110..Bit clock E
 *  0b1111..Clock disabled, connected to zero
 */
#define ASRC_ASRCSR_AOCSB(x)                     (((uint32_t)(((uint32_t)(x)) << ASRC_ASRCSR_AOCSB_SHIFT)) & ASRC_ASRCSR_AOCSB_MASK)

#define ASRC_ASRCSR_AOCSC_MASK                   (0xF00000U)
#define ASRC_ASRCSR_AOCSC_SHIFT                  (20U)
/*! AOCSC - Output Clock Source C
 *  0b0000..Bit clock 0
 *  0b0001..Bit clock 1
 *  0b0010..Bit clock 2
 *  0b0011..Bit clock 3
 *  0b0100..Bit clock 4
 *  0b0101..Bit clock 5
 *  0b0110..Bit clock 6
 *  0b0111..Bit clock 7
 *  0b1000..Bit clock 8
 *  0b1001..Bit clock 9
 *  0b1010..Bit clock A
 *  0b1011..Bit clock B
 *  0b1100..Bit clock C
 *  0b1101..Bit clock D
 *  0b1110..Bit clock E
 *  0b1111..Clock disabled, connected to zero
 */
#define ASRC_ASRCSR_AOCSC(x)                     (((uint32_t)(((uint32_t)(x)) << ASRC_ASRCSR_AOCSC_SHIFT)) & ASRC_ASRCSR_AOCSC_MASK)
/*! @} */

/*! @name ASRCDR1 - ASRC Clock Divider 1 */
/*! @{ */

#define ASRC_ASRCDR1_AICPA_MASK                  (0x7U)
#define ASRC_ASRCDR1_AICPA_SHIFT                 (0U)
/*! AICPA - Input Clock Prescaler A */
#define ASRC_ASRCDR1_AICPA(x)                    (((uint32_t)(((uint32_t)(x)) << ASRC_ASRCDR1_AICPA_SHIFT)) & ASRC_ASRCDR1_AICPA_MASK)

